#+TITLE: with-assoc - a library for creating variables from alists
#+DATE: <2021-05-13>
#+AUTHOR: Cyrus Harmon
#+HTML_DOCTYPE: html5
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}

* with-assoc
A library for working with association lists providing macros that
hide the use of cl:assoc.

** Overview
When working with assoc functions, one ends up calling something like:

#+begin_src lisp :evasl no
  (cdr (assoc foo :bar))
#+end_src

quite frequently. In order to save typing a few characters, we can
define some macro-ology.

If we define an association list such as:

#+begin_src lisp :session
  (defparameter *al* '((:foo . "bar")
                       (:baz . "wizard")))
#+end_src

#+RESULTS:
: *AL*

The standrad way to get access to the element whose car is :foo would be:
#+begin_src lisp :session
  (cdr (assoc :foo *al*))
#+end_src

#+RESULTS:
: bar

With the with-assoc library we can do the following:

#+begin_src lisp :session
  (with-assoc:with-assoc (foo)
      *al*
    foo)
#+end_src

#+RESULTS:
: bar

Obviously this doesn't save us much typing (quite the opposite in
fact), but if we're using lots of pairs in association lists and
particularly if we're reusing the same values multiple value times, it
can be convenient to have some short-hand syntax for

#+begin_src lisp :eval no
  (let ((foo (cdr (assoc *al*) :foo)))
    ...)
#+end_src

** common-lisp:assoc
The common lisp assoc function takes an item and a list of pairs
(conses) and returns the first pair whose car satisfies a test. The
specifics of the test are specified by the key and test keyword
arguments. If the key argument is nil (the default) then the car of
the pair itself is tested, otherwise the results of calling (key (car
<pair>)) are tested against item via the provided for test function,
or is via #'eql if no test function is supplied.


** with-assoc
with-assoc is meant to be used when item is tested against the items
in the associative list with #'eql.

#+begin_src lisp :session
  (with-assoc:with-assoc (foo)
      *al*
    foo)
#+end_src

#+RESULTS:
: bar

** with-assoc-equal
with-assoc is meant to be used when item is tested against the items
in the associative list with #'equal, such as when the items are
strings, rather than keywords.

#+begin_src lisp :session
  (defparameter *al2* '(("FOO" . "bar")
                        (:baz . "wizard")))

  (with-assoc:with-assoc (:foo :baz)
      *al2*
    (list foo baz))
#+end_src

#+RESULTS:
| NIL | wizard |

** with-assoc*
with-assoc* take keyword arguments key and test which provide the full
flexibility of the assoc (except for the deprecated :test-not
argument).

#+begin_src lisp :session
  (with-assoc:with-assoc* ((("FOO" foo) :baz) :test 'equal)
      *al2*
    (list foo baz))
#+end_src

#+RESULTS:
| bar | wizard |

** Default values
The various flavors of with-assoc can take an optional default value
in the event that none is provided in the alist. Take for example:

#+begin_src lisp :session
  (with-assoc:with-assoc (:foo :baz (:blort blort "splat"))
      '((:foo . "bar")
        (:baz . "wizard"))
    (list foo baz blort))
#+end_src

#+RESULTS:
| bar | wizard | splat |

